app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
    task = Task.find_by(id: params[:id].to_i)