app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id].to_i)

UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", "almost done"], ["updated_at", "2018-09-21 20:53:36.209009"], ["id", 4]]
INSERT INTO "tasks" ("name", "status", "created_at", "updated_at", "completion_date", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    task = Task.new(task_params)

    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "description" = $2, "status" = $3, "completion_date" = $4, "updated_at" = $5 WHERE "tasks"."id" = $6  [["name", "Second Random Task "], ["description", "Jumping jacks"], ["status", "doing"], ["completion_date", "tonight"], ["updated_at", "2018-09-21 21:43:54.262423"], ["id", 2]]
---
    task = Task.find_by(id: params[:id].to_i)

    task[:name] = params[:task][:name]
    task[:description] = params[:task][:description]
    task[:status] = params[:task][:status]
    task[:completion_date] = params[:task][:completion_date]

    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 27]]
---
    task = Task.find_by(id: params[:id].to_i)
    task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-24 12:12:09 -0700"], ["updated_at", "2018-09-24 19:12:09.963830"], ["id", 23]]
---
    task = Task.find_by(id: params[:id].to_i)

    if task.active?
      task.update(active: true).save